CDiamondGit/stm32SpaceInvaders/src/main.c
/*
 * FUNCTION PROTOTYPES
 */

/* --- Sound / timing / interrupts ----------------------------------------- */
void start_sound_effect_ch1(const uint32_t notes[],
                            const uint32_t times[],
                            uint32_t count,
                            uint32_t repeat);
void start_sound_effect_ch2(const uint32_t notes[],
                            const uint32_t times[],
                            uint32_t count,
                            uint32_t repeat);
void SysTick_Handler(void);
static void stop_sound_effect_ch1(void);
static void stop_sound_effect_ch2(void);

/* --- Hardware setup ------------------------------------------------------- */
void pinMode(GPIO_TypeDef* port, uint32_t pin, uint32_t mode);
static void enablePullUp(GPIO_TypeDef* port, uint32_t pin);
static void initClock(void);
static void initSysTick(void);
static void setupIO(void);

/* --- Utility / timing / random ------------------------------------------- */
void delay(volatile uint32_t ms);
uint32_t xorshift32(void);
static uint8_t shouldFire(uint8_t threshold);
static uint32_t randomFireDelay(void);
static uint32_t randomMainAlienDelay(void);
uint8_t get_random_bit(uint32_t* state);
int isInside(uint16_t x1,
             uint16_t y1,
             uint16_t w,
             uint16_t h,
             uint16_t px,
             uint16_t py);

/* --- Background / screen helpers ----------------------------------------- */
void loadBackground(void);
void clearDisplay(void);

/* --- Game initialisation -------------------------------------------------- */
static void parkAlienBullet(int col);
static void initAlienGrid(void);
static void initGameState(void);
static void resetGame(void);

/* --- Menu / app state screens -------------------------------------------- */
void mainMenu(AppState* as);
void help(AppState* as);
void getPause(PlayingState* ps, AppState* as);
void playing(AppState* as);
void showScoreBoard(AppState* as);
void selectMode(AppState* as, GameMode* gm);

/* --- Input
   ---------------------------------------------------------------- */
static void handleInput(PlayingState* ps, AppState* as);

/* --- Alien movement / firing --------------------------------------------- */
static int isAlienGridMt(void);
static uint16_t getLowestAlienY(void);
static void moveAliens(uint32_t now);
static void updateAlienFire(uint32_t now);
static void moveMainAlien(MainAlien* ma);

/* --- Collision / bullet state -------------------------------------------- */
static int checkCollision(uint16_t o1X,
                          uint16_t o1Y,
                          uint16_t o1w,
                          uint16_t o1h,
                          uint16_t o2X,
                          uint16_t o2Y,
                          uint16_t o2w,
                          uint16_t o2h);
static void resetAlienBullet(int col);
static void resetPlayerBullet(void);
static void repairAliensUnderRect(uint16_t rx,
                                  uint16_t ry,
                                  uint16_t rw,
                                  uint16_t rh);
static int updateAlienBulletCollision(void);
static void updatePlayerCollision(void);
static int checkGameOver(void);
static void updateMainAlienBulletCollision(void);

/* --- Rendering ------------------------------------------------------------ */
static void renderAliens(void);
static void renderShip(void);
static void renderPlayerBullet(void);
static void renderAlienBullets(void);
static void renderBarricade(void);
static void renderScene(void);
static void renderStats(void);
static void renderGameOverScreen(PlayingState* ps, AppState* as);
static void splashScreen();
static void makeBackground(int starCount);
static void buildRandomAlienPattern(void);
static void startAlienRespawn(void);
static void applyAlienRespawnPattern(void);
static void updateAlienRespawn(uint32_t now);

static void printAscii(void);

/*
 * GLOBAL DECLARATIONS
 */

/* --- Sound engine state
   --------------------------------------------------- */
volatile const uint32_t* channel1_notes = 0;
volatile const uint32_t* channel1_times = 0;
volatile uint32_t channel1_note_count = 0;
volatile uint32_t channel1_repeat = 0;
volatile uint32_t channel1_note_index = 0;
volatile int32_t channel1_note_timer = 0;
volatile uint32_t milliseconds = 0;

volatile const uint32_t* channel2_notes = 0;
volatile const uint32_t* channel2_times = 0;
volatile uint32_t channel2_note_count = 0;
volatile uint32_t channel2_repeat = 0;
volatile uint32_t channel2_note_index = 0;
volatile int32_t channel2_note_timer = 0;

/* --- Sound effect data ---------------------------------------------------- */
const uint32_t shoot_notes[3] = {D5, D4, D5};
const uint32_t shoot_times[3] = {80, 100, 80};
const uint32_t shoot_note_count = 3;

const uint32_t explode_notes[11] = {F4, D4, C4, A3, F3, D3, C3, A2, F2, D2, C2};
const uint32_t explode_times[11] = {20, 20, 25, 25, 30, 35, 35, 40, 40, 45, 55};
const uint32_t explode_note_count = 11;

const uint32_t enter_game_notes_ch1[3] = {C3, D3, G3};
const uint32_t enter_game_times_ch1[3] = {150, 150, 150};
const uint32_t enter_game_note_count_ch1 = 3;

const uint32_t enter_game_notes_ch2[3] = {C6, D6, G6};
const uint32_t enter_game_times_ch2[3] = {150, 150, 150};
const uint32_t enter_game_note_count_ch2 = 3;

const uint32_t game_loop_notes[768] = {
    REST,    G5,      A5,      AS5_Bb5, A5,      F5,      A5,      G5,
    REST,    G5,      A5,      AS5_Bb5, C6,      AS5_Bb5, A5,      G5,
    REST,    G5,      A5,      AS5_Bb5, A5,      F5,      A5,      G5,
    D6,      REST,    C6,      REST,    AS5_Bb5, A5,      AS5_Bb5, C6,
    F6,      REST,    REST,    G5,      D5,      D6,      D5,      C6,
    D5,      AS5_Bb5, D5,      A5,      D5,      AS5_Bb5, D5,      A5,
    D5,      G5,      D5,      A5,      D5,      AS5_Bb5, D5,      C6,
    D5,      AS5_Bb5, D5,      A5,      D5,      F5,      D5,      A5,
    D5,      G5,      D5,      G5,      D5,      D6,      D5,      C6,
    D5,      AS5_Bb5, D5,      A5,      D5,      AS5_Bb5, D5,      A5,
    D5,      AS5_Bb5, D5,      A5,      D5,      AS5_Bb5, D5,      C6,
    D5,      AS5_Bb5, D5,      A5,      D5,      F5,      D5,      A5,
    D5,      G5,      D5,      G5,      D5,      D6,      D5,      C6,
    D5,      AS5_Bb5, D5,      A5,      D5,      AS5_Bb5, D5,      A5,
    D5,      G5,      D5,      A5,      D5,      AS5_Bb5, D5,      C6,
    D5,      AS5_Bb5, D5,      A5,      D5,      F5,      D5,      A5,
    D5,      G5,      D5,      AS5_Bb5, D5,      D6,      D5,      C6,
    D5,      AS5_Bb5, D5,      A5,      D5,      AS5_Bb5, D5,      A5,
    D5,      G5,      D5,      A5,      D5,      AS5_Bb5, D5,      C6,
    D5,      AS5_Bb5, D5,      A5,      D5,      F5,      D5,      A5,
    D5,      G5,      D5,      C6,      C6,      F6,      D6,      REST,
    REST,    REST,    C6,      AS5_Bb5, C6,      F6,      D6,      C6,
    AS5_Bb5, C6,      F6,      D6,      REST,    REST,    REST,    C6,
    D6,      DS6_Eb6, F6,      D6,      REST,    DS6_Eb6, REST,    C6,
    F6,      D6,      REST,    REST,    REST,    C6,      AS5_Bb5, C6,
    F6,      D6,      C6,      AS5_Bb5, C6,      F6,      D6,      REST,
    REST,    REST,    C6,      D6,      DS6_Eb6, F6,      D5,      FS5_Gb5,
    F5,      A5,      A5,      G5,      A5,      G5,      A5,      G5,
    AS5_Bb5, A5,      G5,      F5,      A5,      G5,      D5,      A5,
    G5,      D5,      A5,      G5,      D5,      AS5_Bb5, C6,      A5,
    AS5_Bb5, G5,      D5,      D6,      D5,      C6,      D5,      AS5_Bb5,
    D5,      A5,      D5,      AS5_Bb5, D5,      A5,      D5,      G5,
    D5,      A5,      D5,      AS5_Bb5, D5,      C6,      D5,      AS5_Bb5,
    D5,      A5,      D5,      F5,      D5,      A5,      D5,      G5,
    D5,      G5,      D5,      D6,      D5,      C6,      D5,      AS5_Bb5,
    D5,      A5,      D5,      AS5_Bb5, D5,      A5,      D5,      AS5_Bb5,
    D5,      A5,      D5,      AS5_Bb5, D5,      C6,      D5,      AS5_Bb5,
    D5,      A5,      D5,      F5,      D5,      A5,      D5,      G5,
    D5,      G5,      D5,      D6,      D5,      C6,      D5,      AS5_Bb5,
    D5,      A5,      D5,      AS5_Bb5, D5,      A5,      D5,      G5,
    D5,      A5,      D5,      AS5_Bb5, D5,      C6,      D5,      AS5_Bb5,
    D5,      A5,      D5,      F5,      D5,      A5,      D5,      G5,
    D5,      AS5_Bb5, D5,      D6,      D5,      C6,      D5,      AS5_Bb5,
    D5,      A5,      D5,      AS5_Bb5, D5,      A5,      D5,      G5,
    D5,      A5,      D5,      AS5_Bb5, D5,      C6,      D5,      AS5_Bb5,
    D5,      A5,      D5,      F5,      D5,      A5,      D5,      G5,
    D5,      C6,      C6,      F6,      D6,      REST,    REST,    REST,
    C5,      REST,    A4,      AS4_Bb4, C5,      D6,      G4,      AS4_Bb4,
    G4,      C5,      G4,      D6,      G4,      C6,      F4,      A4,
    F4,      F5,      F4,      D6,      DS4_Eb4, D6,      REST,    E4,
    F4,      GS4_Ab4, REST,    AS4_Bb4, REST,    DS5_Eb5, GS4_Ab4, B4,
    GS4_Ab4, CS5_Db5, GS4_Ab4, DS5_Eb5, GS4_Ab4, CS5_Db5, FS4_Gb4, AS4_Bb4,
    FS4_Gb4, FS5_Gb5, FS4_Gb4, DS5_Eb5, E5,      D5,      REST,    CS5_Db5,
    REST,    AS4_Bb4, B4,      CS5_Db5, DS5_Eb5, GS4_Ab4, B4,      GS4_Ab4,
    CS5_Db5, GS4_Ab4, DS5_Eb5, GS4_Ab4, CS5_Db5, FS4_Gb4, AS4_Bb4, FS4_Gb4,
    FS5_Gb5, FS4_Gb4, DS5_Eb5, E5,      DS5_Eb5, REST,    DS5_Eb5, E5,
    FS5_Gb5, CS5_Db5, E5,      CS4_Db4, DS5_Eb5, E5,      G5,      AS5_Bb5,
    GS5_Ab5, DS5_Eb5, DS6_Eb6, DS5_Eb5, CS6_Db6, DS5_Eb5, B5,      DS5_Eb5,
    AS5_Bb5, DS5_Eb5, B5,      DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5,
    AS5_Bb5, DS5_Eb5, B5,      DS5_Eb5, CS6_Db6, DS5_Eb5, B5,      DS5_Eb5,
    AS5_Bb5, DS5_Eb5, FS5_Gb5, DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5,
    GS5_Ab5, DS5_Eb5, DS6_Eb6, DS5_Eb5, CS6_Db6, DS5_Eb5, B5,      DS5_Eb5,
    AS5_Bb5, DS5_Eb5, B5,      DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5,
    AS5_Bb5, DS5_Eb5, B5,      DS5_Eb5, CS6_Db6, DS5_Eb5, B5,      DS5_Eb5,
    AS5_Bb5, DS5_Eb5, FS5_Gb5, DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5,
    GS5_Ab5, DS5_Eb5, DS6_Eb6, DS5_Eb5, CS6_Db6, DS5_Eb5, B5,      DS5_Eb5,
    AS5_Bb5, DS5_Eb5, B5,      DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5,
    AS5_Bb5, DS5_Eb5, B5,      DS5_Eb5, CS6_Db6, DS5_Eb5, B5,      DS5_Eb5,
    AS5_Bb5, DS5_Eb5, FS5_Gb5, DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5,
    GS5_Ab5, DS5_Eb5, DS6_Eb6, DS5_Eb5, CS6_Db6, DS5_Eb5, B5,      DS5_Eb5,
    AS5_Bb5, DS5_Eb5, B5,      DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5,
    AS5_Bb5, DS5_Eb5, B5,      DS5_Eb5, CS6_Db6, DS5_Eb5, B5,      DS5_Eb5,
    AS5_Bb5, DS5_Eb5, FS5_Gb5, DS5_Eb5, AS5_Bb5, DS5_Eb5, GS5_Ab5, DS5_Eb5,
    CS6_Db6, FS6_Gb6, DS6_Eb6, REST,    REST,    REST,    CS6_Db6, B5,
    CS6_Db6, FS6_Gb6, DS6_Eb6, CS6_Db6, B5,      CS6_Db6, FS6_Gb6, DS6_Eb6,
    REST,    REST,    REST,    CS6_Db6, B5,      E6,      F6,      DS6_Eb6,
    REST,    E6,      REST,    REST,    CS6_Db6, FS6_Gb6, DS6_Eb6, REST,
    REST,    REST,    CS6_Db6, B5,      CS6_Db6, FS6_Gb6, DS6_Eb6, CS6_Db6,
    B5,      CS6_Db6, FS6_Gb6, DS6_Eb6, REST,    REST,    REST,    CS5_Db5,
    DS5_Eb5, E5,      F5,      DS5_Eb5, G5,      GS5_Ab5, AS5_Bb5, AS5_Bb5,
    GS5_Ab5, AS5_Bb5, GS5_Ab5, AS5_Bb5, GS5_Ab5, B6,      AS5_Bb5, GS5_Ab5,
    FS5_Gb5, AS5_Bb5, GS6_Ab6, DS5_Eb5, AS5_Bb5, GS6_Ab6, DS5_Eb5, AS5_Bb5,
    GS6_Ab6, DS5_Eb5, B5,      CS6_Db6, AS5_Bb5, B5,      GS5_Ab5, REST,
    REST};
const uint32_t game_loop_times[768] = {
    417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 417,
    417, 417, 417, 417, 417, 417, 417, 417, 417, 417, 208, 208, 417, 417, 417,
    208, 208, 208, 208, 417, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    208, 104, 208, 417, 104, 104, 312, 312, 625, 208, 208, 208, 104, 208, 104,
    208, 417, 208, 208, 312, 312, 312, 104, 208, 208, 208, 104, 208, 104, 208,
    417, 208, 208, 312, 312, 625, 208, 208, 208, 104, 208, 104, 208, 417, 208,
    208, 312, 312, 208, 208, 208, 208, 312, 625, 312, 625, 312, 625, 208, 208,
    208, 208, 312, 312, 208, 312, 312, 208, 312, 312, 208, 417, 417, 417, 417,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 208, 52,  52,  52,  52,  104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    417, 417, 208, 208, 156, 156, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 208, 104, 104, 208, 208, 208,
    208, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 417, 417, 208, 208, 156, 156, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 417, 208, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104,
    104, 104, 104, 208, 104, 208, 104, 208, 417, 208, 208, 312, 312, 625, 208,
    208, 208, 104, 208, 104, 208, 417, 208, 208, 312, 312, 312, 104, 104, 208,
    104, 208, 104, 208, 417, 208, 208, 312, 312, 625, 208, 208, 208, 104, 208,
    104, 208, 417, 208, 208, 312, 312, 208, 208, 208, 208, 312, 312, 312, 312,
    208, 208, 104};
const uint32_t game_loop_note_count = 768;

