CDiamondGit/stm32SpaceInvaders/src/main.c
const uint32_t game_win_notes_ch1[4] = {C3, E3, G3, C4};
const uint32_t game_win_times_ch1[4] = {200, 200, 200, 200};
const uint32_t game_win_note_count_ch1 = 4;

const uint32_t game_win_notes_ch2[4] = {C5, E5, G5, C6};
const uint32_t game_win_times_ch2[4] = {200, 200, 200, 200};
const uint32_t game_win_note_count_ch2 = 4;

const uint32_t game_lose_notes_ch1[4] = {C4, B3, AS3_Bb3, A3};
const uint32_t game_lose_times_ch1[4] = {200, 200, 200, 200};
const uint32_t game_lose_note_count_ch1 = 4;

const uint32_t game_lose_notes_ch2[4] = {C6, B5, AS5_Bb5, A5};
const uint32_t game_lose_times_ch2[4] = {200, 200, 200, 200};
const uint32_t game_lose_note_count_ch2 = 4;

const uint32_t lose_life_notes[2] = {FS2_Gb2, FS2_Gb2};
const uint32_t lose_life_times[2] = {160, 160};
const uint32_t lose_life_note_count = 2;

const uint32_t aliens_spawning_notes[3] = {G6, B6, G6};
const uint32_t aliens_spawning_times[3] = {220, 220, 220};
const uint32_t aliens_spawning_note_count = 3;

/* --- Runtime game globals ------------------------------------------------- */
static uint32_t lastUpdate = 0;
static const uint32_t FRAME_DELAY = 16;  // 1000ms / 16 ms ~ 60 fps
// decrease to increase fps
// for eg if set to 8 => 1000ms / 8ms ~ 120 (display cant handle)
// in other words in a 1 second(1000 ms) 60 frames will be rendered if delay
// between frame is set to 16 ms so in code it can be used as, if difference
// between current and last updated time is less than FRAME_DELAY halt
// everything

AppState currentAppState = MAINMENU;
GameMode currentGameMode = EASY;

static GameState gs;
static uint32_t randState;

static ScoreRecord records[MAX_RECORDS] = {
    {"___", 0000}, {"___", 0000}, {"___", 0000}, {"___", 0000}, {"___", 0000},
};

/*
 * ASSET DECLARATIONS
 */

static const uint16_t spaceShip[] = {

    0,     0,     0,     0,     0,     34882, 34882, 0,     0,     0,     0,
    0,     0,     0,     0,     0,     34882, 37012, 37012, 54701, 0,     0,
    0,     0,     0,     0,     0,     0,     12692, 33585, 33585, 28820, 0,
    0,     0,     0,     0,     0,     0,     9521,  41769, 61181, 61181, 41769,
    42818, 0,     0,     0,     0,     0,     0,     10058, 49961, 18138, 18138,
    41769, 52595, 0,     0,     0,     0,     0,     21933, 52067, 49961, 18138,
    18138, 49961, 28292, 21933, 0,     0,     63414, 28820, 49961, 28027, 41769,
    41769, 41769, 41769, 19299, 41769, 37012, 63670, 35154, 37012, 49961, 28027,
    28820, 37012, 37012, 37012, 19299, 41769, 37012, 35154, 0,     35154, 41769,
    27755, 37012, 35154, 35154, 37012, 28292, 41769, 35154, 0,     0,     0,
    34361, 34361, 34369, 47302, 47302, 34882, 34361, 34361, 0,     0,     0,
    0,     0,     0,     34369, 34882, 33577, 34882, 0,     0,     0,     0,
    0,     0,     0,     0,     0,     45196, 21933, 0,     0,     0,     0,
    0,
};

static const uint16_t blueAlienBoth[][88] = {
    {0,     0,     41187, 0,     0,     0,     0,     0,     41187, 0,
     0,     41187, 0,     0,     41187, 0,     0,     0,     41187, 0,
     0,     41187, 41187, 0,     41187, 41187, 41187, 41187, 41187, 41187,
     41187, 0,     41187, 41187, 41187, 41187, 0,     41187, 41187, 41187,
     0,     41187, 41187, 41187, 41187, 41187, 41187, 41187, 41187, 41187,
     41187, 41187, 41187, 41187, 41187, 0,     41187, 41187, 41187, 41187,
     41187, 41187, 41187, 41187, 41187, 0,     0,     0,     41187, 0,
     0,     0,     0,     0,     41187, 0,     0,     0,     41187, 0,
     0,     0,     0,     0,     0,     0,     41187, 0},
    {0,     0,     41187, 0,     0,     0,     0,     0,     41187, 0,
     0,     0,     0,     0,     41187, 0,     0,     0,     41187, 0,
     0,     0,     0,     0,     41187, 41187, 41187, 41187, 41187, 41187,
     41187, 0,     0,     0,     41187, 41187, 0,     41187, 41187, 41187,
     0,     41187, 41187, 0,     41187, 41187, 41187, 41187, 41187, 41187,
     41187, 41187, 41187, 41187, 41187, 41187, 0,     41187, 41187, 41187,
     41187, 41187, 41187, 41187, 0,     41187, 41187, 0,     41187, 0,
     0,     0,     0,     0,     41187, 0,     41187, 0,     0,     0,
     41187, 41187, 0,     41187, 41187, 0,     0,     0}};
static const uint16_t redAlien[][88] = {

    {
        0,     0,     65320, 0,     0,     0,     0,     0,     65320, 0,
        0,     65320, 0,     0,     65320, 0,     0,     0,     65320, 0,
        0,     65320, 65320, 0,     65320, 65320, 65320, 65320, 65320, 65320,
        65320, 0,     65320, 65320, 65320, 65320, 0,     65320, 65320, 65320,
        0,     65320, 65320, 65320, 65320, 65320, 65320, 65320, 65320, 65320,
        65320, 65320, 65320, 65320, 65320, 0,     65320, 65320, 65320, 65320,
        65320, 65320, 65320, 65320, 65320, 0,     0,     0,     65320, 0,
        0,     0,     0,     0,     65320, 0,     0,     0,     65320, 0,
        0,     0,     0,     0,     0,     0,     65320, 0,
    },
    {
        0,     0,     65320, 0,     0,     0,     0,     0,     65320, 0,
        0,     0,     0,     0,     65320, 0,     0,     0,     65320, 0,
        0,     0,     0,     0,     65320, 65320, 65320, 65320, 65320, 65320,
        65320, 0,     0,     0,     65320, 65320, 0,     65320, 65320, 65320,
        0,     65320, 65320, 0,     65320, 65320, 65320, 65320, 65320, 65320,
        65320, 65320, 65320, 65320, 65320, 65320, 0,     65320, 65320, 65320,
        65320, 65320, 65320, 65320, 0,     65320, 65320, 0,     65320, 0,
        0,     0,     0,     0,     65320, 0,     65320, 0,     0,     0,
        65320, 65320, 0,     65320, 65320, 0,     0,     0,
    }};
static const uint16_t greenAlien[][88] = {
    {0,     0,     51975, 0,     0,     0,     0,     0,     51975, 0,
     0,     51975, 0,     0,     51975, 0,     0,     0,     51975, 0,
     0,     51975, 51975, 0,     51975, 51975, 51975, 51975, 51975, 51975,
     51975, 0,     51975, 51975, 51975, 51975, 0,     51975, 51975, 51975,
     0,     51975, 51975, 51975, 51975, 51975, 51975, 51975, 51975, 51975,
     51975, 51975, 51975, 51975, 51975, 0,     51975, 51975, 51975, 51975,
     51975, 51975, 51975, 51975, 51975, 0,     0,     0,     51975, 0,
     0,     0,     0,     0,     51975, 0,     0,     0,     51975, 0,
     0,     0,     0,     0,     0,     0,     51975, 0},
    {
        0,     0,     51975, 0,     0,     0,     0,     0,     51975, 0,
        0,     0,     0,     0,     51975, 0,     0,     0,     51975, 0,
        0,     0,     0,     0,     51975, 51975, 51975, 51975, 51975, 51975,
        51975, 0,     0,     0,     51975, 51975, 0,     51975, 51975, 51975,
        0,     51975, 51975, 0,     51975, 51975, 51975, 51975, 51975, 51975,
        51975, 51975, 51975, 51975, 51975, 51975, 0,     51975, 51975, 51975,
        51975, 51975, 51975, 51975, 0,     51975, 51975, 0,     51975, 0,
        0,     0,     0,     0,     51975, 0,     51975, 0,     0,     0,
        51975, 51975, 0,     51975, 51975, 0,     0,     0,
    }};
static const uint16_t explosion[88] = {
    0,    0,     0,     0,     0,     0,     21809, 2105,  1073,  2105,  0,
    2105, 61747, 53562, 21809, 53562, 61747, 15139, 15139, 2105,  2105,  2105,
    0,    1073,  21809, 32158, 15139, 64354, 24375, 7013,  24375, 2105,  2105,
    0,    15139, 7013,  15139, 24375, 32158, 24375, 7013,  64354, 53562, 0,
    0,    61747, 7013,  7013,  24375, 24375, 24375, 15139, 7013,  53562, 0,
    0,    15139, 15139, 21809, 15139, 15139, 7013,  7013,  21809, 11313, 0,
    0,    0,     0,     7013,  61747, 7013,  32158, 64354, 11313, 0,     0,
    0,    0,     0,     53562, 1073,  21809, 61747, 2105,  0,     0,     0};

static const uint16_t mainAlienSpr[352] = {
    0,     0,     0,     0,     65320, 65320, 0,     0,     0,     0,     0,
    0,     0,     0,     0,     0,     65320, 65320, 0,     0,     0,     0,
    0,     0,     0,     0,     65320, 65320, 0,     0,     0,     0,     0,
    0,     0,     0,     0,     0,     65320, 65320, 0,     0,     0,     0,
    65320, 0,     0,     0,     0,     0,     65320, 65320, 0,     65320, 0,
    0,     0,     0,     65320, 65320, 0,     0,     0,     0,     0,     65320,
    65320, 65320, 0,     0,     0,     0,     65320, 65320, 0,     0,     0,
    65320, 0,     0,     65320, 65320, 0,     0,     0,     0,     65320, 65320,
    65320, 65320, 0,     0,     65320, 65320, 65320, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 65320, 65320, 65320, 0,     0,     65320, 65320,
    65320, 65320, 0,     0,     65320, 65320, 65320, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 65320, 65320, 65320, 0,     0,     65320, 65320,
    65320, 65320, 65320, 65320, 65320, 65321, 27663, 27663, 65320, 65321, 65320,
    65320, 65320, 65320, 27663, 27663, 65320, 65320, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 65320, 65321, 27663, 27663, 65320, 65320, 65320,
    65320, 65320, 65320, 27663, 27663, 65320, 65320, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 27663, 27663, 57600, 57600, 27663, 27663, 65320,
    65320, 27663, 27663, 57600, 57600, 27663, 27663, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 27663, 27663, 57600, 57600, 27663, 27663, 65320,
    65320, 27663, 27663, 57600, 57600, 27663, 27663, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 65320, 65320, 27663, 27663, 65321, 65320, 27663,
    27663, 65320, 65320, 27663, 27663, 65320, 65320, 65320, 65320, 65320, 65320,
    0,     65320, 65320, 65320, 65320, 65320, 27663, 27663, 65320, 65320, 27663,
    27663, 65320, 65320, 27663, 27663, 65320, 65320, 65320, 65320, 65320, 0,
    0,     65320, 65320, 65320, 0,     0,     65320, 65320, 65320, 65320, 65320,
    65320, 65320, 65320, 65320, 65320, 0,     0,     65320, 65320, 65320, 0,
    0,     65320, 65320, 65320, 16151, 0,     65320, 65320, 17144, 17144, 65320,
    65320, 17144, 17144, 65320, 65320, 0,     0,     65320, 65320, 65320, 0,
    0,     0,     65320, 65320, 0,     0,     0,     0,     17144, 17144, 0,
    0,     17144, 17144, 0,     0,     0,     0,     65320, 65320, 0,     0,
    0,     0,     65320, 65320, 0,     0,     0,     0,     0,     0,     0,
    0,     0,     0,     0,     0,     0,     0,     65320, 65320, 0,     0,
};

static const uint16_t respawn_flicker[88] = {
    0,     65535, 0, 0,     0, 0, 0,     0, 0,     65535, 0,     0, 0,
    65535, 0,     0, 0,     0, 0, 65535, 0, 0,     0,     0,     0, 65535,
    0,     0,     0, 65535, 0, 0, 0,     0, 0,     0,     0,     0, 0,
    0,     0,     0, 0,     0, 0, 0,     0, 0,     0,     0,     0, 0,
    0,     0,     0, 0,     0, 0, 65535, 0, 0,     0,     65535, 0, 0,
    0,     0,     0, 65535, 0, 0, 0,     0, 0,     65535, 0,     0, 0,
    65535, 0,     0, 0,     0, 0, 0,     0, 65535, 0,
};

