CDiamondGit/stm32SpaceInvaders/src/main.c
//   // Set LEDs based on lives
//   GPIOA->ODR |= (lives >= 1) ? (1 << 1) : 0;
//   GPIOB->ODR |= (lives >= 2) ? (1 << 3) : 0;
//   GPIOA->ODR |= (lives == 3) ? (1 << 2) : 0;
// }

static void lightLivesIndicator(int lives) {
  // Clear all LEDs
  GPIOA->BSRR = (1 << (1 + 16));
  GPIOA->BSRR = (1 << (10 + 16));
  GPIOB->BSRR = (1 << (3 + 16));

  // Set LEDs
  if (lives >= 1)
    GPIOA->BSRR = (1 << 1);
  if (lives >= 2)
    GPIOB->BSRR = (1 << 3);
  if (lives >= 3)
    GPIOA->BSRR = (1 << 10);
}
/* --- Utility / timing / random -------------------------------------------
 */
void delay(volatile uint32_t ms) {
  uint32_t end = ms + milliseconds;
  while (milliseconds != end)
    __asm(" wfi ");
}
uint32_t xorshift32() {
  randState ^= randState << 13;
  randState ^= randState >> 17;
  randState ^= randState << 5;
  return randState;
}
static uint8_t shouldFire(uint8_t threshold) {
  return (xorshift32() % threshold) ==
         0;  // threshold => more higher less likely to fire
  /*
  threshold = 3:
  possible results of % 3 → { 0, 1, 2 }
  only 0 returns 1 → 1 in 3 chance = 33%
  */
}
static uint32_t randomFireDelay(void) {
  uint32_t range = ALIEN_FIRE_MAX_MS - ALIEN_FIRE_MIN_MS;
  return ALIEN_FIRE_MIN_MS + (xorshift32() % range);
}

static uint32_t randomMainAlienDelay(void) {
  uint32_t range = MAIN_ALIEN_MAX_DELAY - MAIN_ALIEN_MIN_DELAY;
  return MAIN_ALIEN_MIN_DELAY + (xorshift32() % range);
}

uint8_t get_random_bit(uint32_t* state) {
  (void)state;
  return xorshift32() & 1u;
}
int isInside(uint16_t x1,
             uint16_t y1,
             uint16_t w,
             uint16_t h,
             uint16_t px,
             uint16_t py) {
  return (px >= x1 && px <= x1 + w && py >= y1 && py <= y1 + h) ? 1 : 0;
}

/* --- Background / screen helpers ----------------------------------------- */
void loadBackground() {
  makeBackground(40);
  printTextBold("Space", 10, 10, 1, 0);
  printTextBold("Invader", 40, 20, 1, 0);

  putImage(20, 20, 11, 8, greenAlien[0], 1, 0);
  putImage(80, 10, 11, 8, greenAlien[1], 1, 0);
  for (int i = 0; i < 7; i++) {
    const uint16_t* spr = (i % 3 == 0)   ? redAlien[i % 2]
                          : (i % 3 == 1) ? greenAlien[i % 2]
                                         : blueAlienBoth[i % 2];
    putImage(i * 18, 145, 11, 8, spr, i % 2, 0);
  }
  // putImage(110, 0, 128,50, bottom_background, 1, 0);
}
void clearDisplay() {
  fillRectangle(0, 0, SCREEN_W, SCREEN_H, 0);
}

/* --- Game initialisation -------------------------------------------------- */
static void parkAlienBullet(int col) {
  AlienGrid* ag = &gs.aliens;
  Bullet* b = &ag->ab[col];

  // find the bottom alive alien in the column

  int row = -1;
  for (int i = ALIEN_ROWS - 1; i >= 0; i--) {
    if (ag->status[i][col] == 0) {
      row = i;
      break;
    }
  }

  // no
  if (row == -1) {
    b->state = BULLET_READY;
    return;
  }

  b->coords.x = b->coords.oldX =
      (uint16_t)(ag->offsetX + ag->basePosX[col] + BULLET_OFFSET_X);
  b->coords.y = b->coords.oldY =
      (uint16_t)(ag->offsetY + ag->basePosY[row] + ALIEN_H);

  b->speed = ALIEN_BULLET_SPEED;
  b->state = BULLET_READY;
}
static void initAlienGrid() {
  AlienGrid* ag = &gs.aliens;
  ag->offsetX = ag->oldOffsetX = ALIEN_ORIGIN_X;
  ag->offsetY = ag->oldOffsetY = ALIEN_ORIGIN_Y;
  ag->dirX = -1;
  ag->earToggle = 0;
  ag->lastMoveTime = 0;

  ag->respawning = 0;
  ag->previewVisible = 0;
  ag->flashStep = 0;
  ag->redrawAll = 1;
  ag->respawnTimer = 0;

  for (int i = 0; i < ALIEN_ROWS; i++)
    ag->basePosY[i] = (uint16_t)(i * (ALIEN_H + ALIEN_GAP_Y));
  for (int j = 0; j < ALIEN_COLS; j++)
    ag->basePosX[j] = (uint16_t)(j * (ALIEN_W + ALIEN_GAP_X));

  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      ag->status[i][j] = 0;
      ag->nextStatus[i][j] = 1;
    }
  }

  for (int i = 0; i < ALIEN_COLS; i++) {
    parkAlienBullet(i);
    ag->nextFireTime[i] = milliseconds + randomFireDelay();
  }
}

static void buildRandomAlienPattern(void) {
  AlienGrid* ag = &gs.aliens;

  int total = ALIEN_ROWS * ALIEN_COLS;
  int target = ALIEN_RESPAWN_MIN +
               (xorshift32() % (ALIEN_RESPAWN_MAX - ALIEN_RESPAWN_MIN + 1));

  if (target > total)
    target = total;

  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      ag->nextStatus[i][j] = 1; /* dead / empty */
    }
  }

  int placed = 0;
  while (placed < target) {
    int idx = xorshift32() % total;
    int r = idx / ALIEN_COLS;
    int c = idx % ALIEN_COLS;

    if (ag->nextStatus[r][c] != 0) {
      ag->nextStatus[r][c] = 0; /* alive */
      placed++;
    }
  }
}

static void startAlienRespawn(void) {
  AlienGrid* ag = &gs.aliens;

  ag->respawning = 1;
  ag->previewVisible = 0;
  ag->flashStep = 0;
  ag->respawnTimer = milliseconds;
  ag->redrawAll = 1;

  ag->offsetX = ALIEN_ORIGIN_X;
  ag->offsetY = ALIEN_ORIGIN_Y;
  ag->oldOffsetX = ALIEN_ORIGIN_X;
  ag->oldOffsetY = ALIEN_ORIGIN_Y;
  ag->dirX = -1;
  ag->earToggle = 0;
  ag->lastMoveTime = milliseconds;

  buildRandomAlienPattern();

  resetPlayerBullet();

  for (int j = 0; j < ALIEN_COLS; j++) {
    fillRectangle(gs.aliens.ab[j].coords.x, gs.aliens.ab[j].coords.y, BULLET_W,
                  BULLET_H, 0);
    fillRectangle(gs.aliens.ab[j].coords.oldX, gs.aliens.ab[j].coords.oldY,
                  BULLET_W, BULLET_H, 0);
    gs.aliens.ab[j].state = BULLET_READY;
  }
}

static void applyAlienRespawnPattern(void) {
  AlienGrid* ag = &gs.aliens;

  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      ag->status[i][j] = ag->nextStatus[i][j];
    }
  }

  for (int j = 0; j < ALIEN_COLS; j++) {
    parkAlienBullet(j);
    ag->nextFireTime[j] = milliseconds + randomFireDelay();
  }

  ag->respawning = 0;
  ag->previewVisible = 0;
  ag->flashStep = 0;
  ag->redrawAll = 1;
  ag->lastMoveTime = milliseconds;
  ag->oldOffsetX = ag->offsetX;
  ag->oldOffsetY = ag->offsetY;
}

static void updateAlienRespawn(uint32_t now) {
  AlienGrid* ag = &gs.aliens;

  if (!ag->respawning)
    return;

  if (now - ag->respawnTimer < ALIEN_RESPAWN_FLASH_MS)
    return;

  ag->respawnTimer = now;
  ag->flashStep++;

  switch (ag->flashStep) {
    case 1:
    case 3:
    case 5:
      ag->previewVisible = 1;
      ag->redrawAll = 1;
      start_sound_effect_ch1(aliens_spawning_notes, aliens_spawning_times,
                             aliens_spawning_note_count, 0);
      break;

