CDiamondGit/stm32SpaceInvaders/src/main.c
      delay(200);
    }
  }
}

void showScoreBoard(AppState* as) {
  clearDisplay();

  /* --- Heading ---------------------------------------------------------- */
  uint16_t headingColor = RGBToWord(255, 215, 0);  /* gold              */
  uint16_t normalColor = RGBToWord(255, 255, 255); /* white             */
  uint16_t topColor = RGBToWord(255, 215, 0);      /* gold for top score*/
  uint16_t rowColor = RGBToWord(180, 180, 180);    /* grey for rest     */

  printTextBold("SCOREBOARD", 5, 5, headingColor, 0);

  /* --- Divider ---------------------------------------------------------- */
  drawLine(0, 20, SCREEN_W, 20, headingColor);

  /* --- Column headers --------------------------------------------------- */
  printText("NAME", 10, 26, normalColor, 0);
  printText("SCORE", 80, 26, normalColor, 0);
  drawLine(0, 35, SCREEN_W, 35, RGBToWord(80, 80, 80));

  /* --- Rows ------------------------------------------------------------- */
  for (int i = 0; i < MAX_RECORDS; i++) {
    uint16_t y = (uint16_t)(42 + i * 18);
    uint16_t color = (i == 0) ? topColor : rowColor;

    char number = (i + 1) + '0';
    char index[2] = {number, '\0'};

    /* Rank number */
    printText(index, 1, y, color, 0);
    printText(".", 8, y, color, 0);

    /* Initials */
    printText(records[i].initials, 18, y, color, 0);

    /* Score – right aligned at x=80 */
    printNumber(records[i].score, 80, y, color, 0);

    /* Underline each row */
    drawLine(0, (uint16_t)(y + 12), SCREEN_W, (uint16_t)(y + 12),
             RGBToWord(40, 40, 40));
  }

  /* --- Footer ----------------------------------------------------------- */
  drawLine(0, 148, SCREEN_W, 148, headingColor);
  printText("DOWN to go back", 10, 152, RGBToWord(100, 100, 100), 0);

  /* --- Wait for down button to exit ------------------------------------- */
  while ((GPIOA->IDR & (1 << 11)) != 0)
    ; /* wait for press  */
  delay(50);
  while ((GPIOA->IDR & (1 << 11)) == 0)
    ; /* wait for release */
  delay(50);

  *as = MAINMENU;

  return;
}

void getPause(PlayingState* ps, AppState* as) {
  uint16_t pinkColor = RGBToWord(255, 20, 147);

  int selected = 0; /* 0 = Resume, 1 = Main Menu */
  if (*ps == GAMEOVER) {
    clearDisplay();
    printTextBold("GAMEOVER!!", 5, 10, RGBToWord(255, 255, 0), 0);

    ScoreRecord newEntry;
    char alpha = 'A';
    char alphaStr[2] = {alpha, '\0'};
    int position = 0;
    char initials[4] = {'_', '_', '_', '\0'};

    if (gs.score > gs.highScore) {
      printText("New Highscore", 20, 22, RGBToWord(255, 255, 255), 0);
      printTextX2(initials, 50, 40, RGBToWord(255, 255, 0), 0);
      printTextX2("<", 40, 60, pinkColor, 0);
      printTextX2(alphaStr, 60, 60, pinkColor, 0);
      printTextX2(">", 80, 60, pinkColor, 0);

      printText("< > : Navigate", 10, 92, RGBToWord(255, 255, 255), 0);
      printText("UP : Select", 10, 102, RGBToWord(255, 255, 255), 0);
      printText("Corner : Reset", 10, 112, RGBToWord(255, 255, 255), 0);

      printText("Press down key", 10, 125, RGBToWord(255, 255, 255), 0);
      printText("To save and exit", 10, 135, RGBToWord(255, 255, 255), 0);

      while (1) {
        char c = '0';

        if (serialCharAvailable()) {
          c = serialGetCharNonBlocking();
        }

        if (!(GPIOA->IDR & (1 << 11)) ||
            (c == '\r' || c == '\n')) {  // down key to save and exit
          /* Quit to main menu */

          goto save_and_exit;
        }

        if (c != '0') {
          eputchar(c);
          eputchar('\r\n');
        }

        if ((c >= 65 && c <= 90) || (c >= 97 && c <= 122)) {
          if (position >= 3)
            continue;
          initials[position] = c;
          position++;

          fillRectangle(50, 40, 70, 16, 0);
          printTextX2(initials, 50, 40, RGBToWord(255, 255, 0), 0);
          continue;
        }
        /* right button to select letters-------------- PB4*/

        if (!(GPIOB->IDR & (1 << 4))) {  // right key
          alpha = (alpha >= 'Z') ? 'A' : alpha + 1;
          alphaStr[0] = alpha;
          fillRectangle(60, 60, 14, 16, 0);
          printTextX2(alphaStr, 60, 60, pinkColor, 0);
          delay(150);
        }

        /* left button to select letters-------------- PB5*/

        if (!(GPIOB->IDR & (1 << 5))) {  // left key
          alpha = (alpha <= 'A') ? 'Z' : alpha - 1;
          alphaStr[0] = alpha;
          fillRectangle(60, 60, 14, 16, 0);
          printTextX2(alphaStr, 60, 60, pinkColor, 0);
          delay(150);
        }

        /* Corner button to reset the namespace -------------- PA9*/
        if (!(GPIOA->IDR & (1 << 9))) {
          alpha = 'A';
          alphaStr[0] = alpha;
          position = 0;
          initials[0] = '_';
          initials[1] = '_';
          initials[2] = '_';
          printTextX2(initials, 50, 40, RGBToWord(255, 255, 0), 0);
          printTextX2(alphaStr, 60, 60, pinkColor, 0);
        }

        /* UP button to select letter to the current position*/
        if (!(GPIOA->IDR & (1 << 8))) {
          if (position >= 3)
            continue;
          initials[position] = alpha;
          position++;

          fillRectangle(50, 40, 70, 16, 0);
          printTextX2(initials, 50, 40, RGBToWord(255, 255, 0), 0);

          alpha = 'A';
          alphaStr[0] = alpha;
          fillRectangle(60, 60, 14, 16, 0);
          printTextX2(alphaStr, 60, 60, pinkColor, 0);

          delay(200);
        }
      }
    save_and_exit:

      /* Save to leaderboard */

      newEntry.initials[0] = initials[0];
      newEntry.initials[1] = initials[1];
      newEntry.initials[2] = initials[2];
      newEntry.initials[3] = '\0';
      newEntry.score = gs.score;

      for (int i = 0; i < MAX_RECORDS; i++) {
        if (newEntry.score > records[i].score) {
          for (int k = MAX_RECORDS - 1; k > i; k--)
            records[k] = records[k - 1];
          records[i] = newEntry;
          break;
        }
      }

      if (gs.score > gs.highScore) {
        gs.highScore = gs.score;
      }
      gs.score = 0;
      stop_sound_effect_ch1();
      stop_sound_effect_ch2();
      *ps = GAMERUNNING;
      *as = MAINMENU;
      return;
    } else {
      while (1) {
        stop_sound_effect_ch1();
        stop_sound_effect_ch2();
        putImage(55, 20, 11, 8, blueAlienBoth[1], 0, 1);
        printText("Press down key", 10, 125, RGBToWord(255, 255, 255), 0);
        printText("to go to main menu", 10, 135, RGBToWord(255, 255, 255), 0);

        if (!(GPIOA->IDR & (1 << 11))) {  // down key to save and exit
          gs.score = 0;

          *ps = GAMERUNNING;
          *as = MAINMENU;
          delay(200);
          return;
        }
      }
    }
  } else {
    stop_sound_effect_ch2();
    /* Draw pause menu */
    fillRectangle(0, 60, SCREEN_W, 50, 0);
    printTextBold("PAUSED", 35, 65, RGBToWord(255, 255, 0), 0);
    printText("> Resume", 10, 82, RGBToWord(255, 255, 255), 0);
    printText("  Main Menu", 10, 94, RGBToWord(255, 255, 255), 0);

