CDiamondGit/stm32SpaceInvaders/src/main.c
    /* Wait for button release first (debounce the PA11 press that got us
     * here)
     */
    while ((GPIOA->IDR & (1 << 11)) == 0)
      ;
    delay(50);

    while (1) {
      char c = 0;

      if (serialCharAvailable()) {
        c = serialGetCharNonBlocking();
      }

      if (c != 0) {
        eputchar(c);
        eputchar('\r\n');
      }

      /* Highlight selected option */
      printText(selected == 0 ? "> Resume   " : "  Resume   ", 10, 82,
                RGBToWord(255, 255, 255), 0);
      printText(selected == 1 ? "> Main Menu" : "  Main Menu", 10, 94,
                RGBToWord(255, 255, 255), 0);

      /* Down button - move selection down */
      if ((GPIOA->IDR & (1 << 11)) == 0 || (c == 's') || (c == 'S')) {
        selected = !selected; /* toggle between 0 and 1 */
        delay(150);           /* debounce                */
      }

      /* Right/confirm button - PB4 */
      if ((GPIOB->IDR & (1 << 4)) == 0 || (c == 'd') || (c == 'D')) {
        delay(50);
        if (selected == 0) {
          /* Resume */
          fillRectangle(0, 60, SCREEN_W, 50, 0);
          start_sound_effect_ch2(game_loop_notes, game_loop_times,
                                 game_loop_note_count, 1);
          *ps = GAMERUNNING;
          return;
        } else {
          /* Quit to main menu */
          stop_sound_effect_ch1();
          stop_sound_effect_ch2();
          *as = MAINMENU;
          *ps = GAMERUNNING; /* reset state for next play session */
          return;
        }
      }
    }
  }
}

void playing(AppState* as) {
  clearDisplay();

  /* Game */
  gs.lives = 3;
  gs.score = 0;

  initGameState();

  delay(300);

  /* Initial draw */
  renderAliens();
  putImage(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H, spaceShip, 1, 0);
  drawLine(0, HUD_LINE_Y, SCREEN_W, HUD_LINE_Y, HUD_LINE_COLOR);

  start_sound_effect_ch2(game_loop_notes, game_loop_times, game_loop_note_count,
                         1);

  PlayingState currentPlayingState = GAMERUNNING;

  /* Game loop */
  while (1) {
    uint32_t now = milliseconds;
    if (now - lastUpdate < FRAME_DELAY)
      continue;
    lastUpdate = now;

    if (currentPlayingState == PAUSE) {
      getPause(&currentPlayingState, as);
      continue; /* skip this frame, resume next tick */
    }

    /* Advance bullet */
    if (gs.bullet.state == BULLET_FIRE) {
      gs.bullet.coords.y -= gs.bullet.speed;
      if (gs.bullet.coords.y < 5) {
        resetPlayerBullet();
        // renderPlayerBullet();
      }
    } else {
      gs.bullet.coords.x = gs.ship.coords.x + BULLET_OFFSET_X;
      gs.bullet.coords.y = gs.ship.coords.y - BULLET_OFFSET_Y;
    }

    handleInput(&currentPlayingState, as); /* buttons-> positions*/

    if (*as == MAINMENU)
      return;

    if (currentPlayingState == PAUSE) {
      getPause(&currentPlayingState, as);
      if (*as == MAINMENU)
        return; /* quit was selected */
      continue;
    }

    updateMainAlienBulletCollision();
    moveMainAlien(&gs.mysteryAlien);

    AlienGrid* ag = &gs.aliens;

    if (!ag->respawning) {
      for (int j = 0; j < ALIEN_COLS; j++) {
        Bullet* b = &ag->ab[j];
        if (b->state == BULLET_FIRE) {
          b->coords.y += b->speed; /* alien bullets go DOWN */
          if (b->coords.y > HUD_LINE_Y - 5)
            resetAlienBullet(j);
        }
      }

      moveAliens(now);
      updateAlienFire(now);
      updatePlayerCollision();
    } else {
      updateAlienRespawn(now);
    }

    if (updateAlienBulletCollision()) {
      // stop_sound_effect_ch2();
      gs.lives -= 1;
      putImage(gs.ship.coords.x, gs.ship.coords.y, ALIEN_W, ALIEN_H, explosion,
               1, 0);
      // delay(200);
      start_sound_effect_ch1(lose_life_notes, lose_life_times,
                             lose_life_note_count, 0);

      delay(350);

      resetGame();

      continue;
    }

    if (checkGameOver()) {
      gs.lives -= 1;
      currentPlayingState = GAMEOVER;
      lightLivesIndicator(gs.lives);
      stop_sound_effect_ch1();
      stop_sound_effect_ch2();
      renderGameOverScreen(&currentPlayingState, as);
      continue;
    }

    renderScene(); /* positions -> screen           */
    lightLivesIndicator(gs.lives);
  }
}

/* --- Input ----------------------------------------------------------------
 */

static void handleInput(PlayingState* ps, AppState* as) {
  char c = 0;

  if (serialCharAvailable()) {
    c = serialGetCharNonBlocking();
  }

  if (c != 0) {
    eputchar(c);
    eputchar('\r\n');
  }

  /* Right – PB4 or D */
  if (((GPIOB->IDR & (1 << 4)) == 0) || (c == 'd') || (c == 'D')) {
    if (gs.ship.coords.x < SHIP_MAX_X)
      gs.ship.coords.x += gs.ship.speed;
  }

  /* Left – PB5 or A */
  if (((GPIOB->IDR & (1 << 5)) == 0) || (c == 'a') || (c == 'A')) {
    if (gs.ship.coords.x > SHIP_MIN_X)
      gs.ship.coords.x -= gs.ship.speed;
  }

  /* Fire – PA8 or SPACE or W */
  if (((GPIOA->IDR & (1 << 8)) == 0) || (c == ' ') || (c == 'w') ||
      (c == 'W')) {
    if (gs.bullet.state == BULLET_READY) {
      gs.bullet.state = BULLET_FIRE;
      start_sound_effect_ch1(shoot_notes, shoot_times, shoot_note_count, 0);
      // delay(50);
    }
  }

  /* Pause - PA11 or D*/
  if ((GPIOA->IDR & (1 << 11)) == 0 || (c == 'S') || (c == 's')) {
    delay(50);
    *ps = PAUSE;
  }

  /* Corner Button ==>  Main Menu  // PA9*/

  if ((GPIOA->IDR & (1 << 9)) == 0) {
    delay(50);
    *ps = PAUSE;
    stop_sound_effect_ch2();
    stop_sound_effect_ch1();
    *as = MAINMENU;
  }
}

/* --- Alien movement / firing ---------------------------------------------
 */
static int isAlienGridMt(void) {
  AlienGrid* ag = &gs.aliens;
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] == 0) {
        return 0;
      }
    }
  }
  return 1;
}
static uint16_t getLowestAlienY(void) {
  AlienGrid* ag = &gs.aliens;
  for (int i = ALIEN_ROWS - 1; i >= 0; i--) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] == 0) {
        // lowest alive alien Y position
        return (uint16_t)(ag->offsetY + ag->basePosY[i] + ALIEN_H);
      }
    }
  }

