CDiamondGit/stm32SpaceInvaders/src/main.c
  return 0;  // no-alien alive.
}
static void moveAliens(uint32_t now) {
  AlienGrid* ag = &gs.aliens;

  // Stop movement while respawning
  if (ag->respawning)
    return;

  // If all aliens are gone, start respawn sequence
  if (isAlienGridMt()) {
    startAlienRespawn();
    return;
    // stop_sound_effect_ch2();  // stop music briefly
    // start_sound_effect_ch1(game_win_notes_ch1, game_win_times_ch1,
    //                        game_win_note_count_ch1, 0);
    // start_sound_effect_ch2(game_win_notes_ch2, game_win_times_ch2,
    //                        game_win_note_count_ch2, 0);
    // delay(900);  // let win jingle finish (4 x 200ms + buffer)
    // start_sound_effect_ch2(game_loop_notes, game_loop_times,
    //                        game_loop_note_count, 1);
    // initAlienGrid();
  }

  // Control movement speed (frame timing)
  if (now - ag->lastMoveTime < gs.alienSpeed)
    return;
  ag->lastMoveTime = now;

  ag->oldOffsetX = ag->offsetX;
  ag->oldOffsetY = ag->offsetY;

  int16_t nextX = ag->offsetX + (ALIEN_STEP * ag->dirX);
  ag->earToggle = !ag->earToggle;

  if (nextX < ALIEN_MIN_X || nextX > ALIEN_MAX_X) {
    /* Hit a wall: drop down, reverse direction, no horizontal step */

    // Random fire on wall hit
    // TODO: move this to a timed system instead of per wall hit
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->ab[j].state == BULLET_READY && shouldFire(12))
        ag->ab[j].state = BULLET_FIRE;
    }
    ag->offsetY += ALIEN_DROP;
    ag->dirX *= -1;
  } else {
    ag->offsetX = nextX;
  }

  for (int j = 0; j < ALIEN_COLS; j++) {
    if (ag->ab[j].state == BULLET_READY)
      parkAlienBullet(j);
  }
}

static void updateAlienFire(uint32_t now) {
  AlienGrid* ag = &gs.aliens;
  for (int j = 0; j < ALIEN_COLS; j++) {
    if (ag->ab[j].state != BULLET_READY)
      continue; /* already in flight */

    int hasAlive = 0;
    for (int i = 0; i < ALIEN_ROWS; i++)
      if (ag->status[i][j] == 0) {
        hasAlive = 1;
        break;
      }
    if (!hasAlive)
      continue;

    if (now >= ag->nextFireTime[j]) {
      ag->ab[j].state = BULLET_FIRE;
      ag->nextFireTime[j] = now + randomFireDelay();
    }
  }
}

static void moveMainAlien(MainAlien* ma) {
  uint32_t now = milliseconds;

  /* --- Spawn logic --- */
  if (!ma->active) {
    if (now >= ma->nextSpawnTime) {
      ma->active = 1;

      if (channel1_notes == 0) {  // only play if ch1 is free
        start_sound_effect_ch1(aliens_spawning_notes, aliens_spawning_times,
                               aliens_spawning_note_count, 0);
      }

      /* Random direction */
      if (xorshift32() & 1) {
        ma->dir = 1;
        ma->coords.x = 0;
      } else {
        ma->dir = -1;
        ma->coords.x = SCREEN_W - MAIN_ALIEN_W;
      }

      ma->coords.y = MAIN_ALIEN_Y;
      ma->coords.oldX = ma->coords.x;
      ma->coords.oldY = ma->coords.y;

      ma->lastMoveTime = now;
    }
    return;
  }

  /* --- Movement timing --- */
  if (now - ma->lastMoveTime < MAIN_ALIEN_MOVE_DELAY)
    return;

  ma->lastMoveTime = now;

  /* --- Erase old position --- */
  fillRectangle(ma->coords.oldX, ma->coords.oldY, MAIN_ALIEN_W, MAIN_ALIEN_H,
                0);

  /* --- Move --- */
  ma->coords.oldX = ma->coords.x;
  ma->coords.x += ma->speed * ma->dir;

  /* --- Draw --- */
  putImage(ma->coords.x, ma->coords.y, MAIN_ALIEN_W, MAIN_ALIEN_H, mainAlienSpr,
           1, 0);

  /* --- Check bounds --- */
  if (ma->coords.x <= 0 || ma->coords.x >= (SCREEN_W - MAIN_ALIEN_W)) {
    /* erase before disappearing */
    fillRectangle(ma->coords.x, ma->coords.y, MAIN_ALIEN_W, MAIN_ALIEN_H, 0);

    ma->active = 0;
    ma->nextSpawnTime = now + randomMainAlienDelay();
  }
}

/* --- Collision / bullet state --------------------------------------------
 */
static int checkCollision(uint16_t o1X,
                          uint16_t o1Y,
                          uint16_t o1w,
                          uint16_t o1h,
                          uint16_t o2X,
                          uint16_t o2Y,
                          uint16_t o2w,
                          uint16_t o2h) {
  if (o1X + o1w <= o2X)
    return 0;
  if (o1X >= o2X + o2w)
    return 0;
  if (o1Y + o1h <= o2Y)
    return 0;
  if (o1Y >= o2Y + o2h)
    return 0;
  return 1;
}
/*
Alien bullet reset
*/
static void resetAlienBullet(int col) {
  AlienGrid* ag = &gs.aliens;
  Bullet* b = &ag->ab[col];
  /* Erase both positions */
  fillRectangle(b->coords.x, b->coords.y, BULLET_W, BULLET_H, 0);
  fillRectangle(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H, 0);
  parkAlienBullet(col);
}
/*
Player Bullet Reset
*/
static void resetPlayerBullet(void) {
  Bullet* b = &gs.bullet;
  gs.bullet.state = BULLET_READY;

  fillRectangle(b->coords.oldX, b->coords.oldY, BULLET_W, BULLET_H + 5, 0);

  gs.bullet.coords.x = gs.bullet.coords.oldX =
      gs.ship.coords.x + BULLET_OFFSET_X;
  gs.bullet.coords.y = gs.bullet.coords.oldY =
      gs.ship.coords.y - BULLET_OFFSET_Y;
}
static void repairAliensUnderRect(uint16_t rx,
                                  uint16_t ry,
                                  uint16_t rw,
                                  uint16_t rh) {
  AlienGrid* ag = &gs.aliens;
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] != 0)
        continue;
      uint16_t ax = (uint16_t)(ag->offsetX + ag->basePosX[j]);
      uint16_t ay = (uint16_t)(ag->offsetY + ag->basePosY[i]);
      if (checkCollision(ax, ay, ALIEN_W, ALIEN_H, rx, ry, rw, rh)) {
        /* Which sprite to use for this row */
        const uint16_t* spr = (i == 0)   ? redAlien[ag->earToggle]
                              : (i == 1) ? greenAlien[ag->earToggle]
                                         : blueAlienBoth[ag->earToggle];
        putImage(ax, ay, ALIEN_W, ALIEN_H, spr, 1, 0);
      }
    }
  }
}
static int updateAlienBulletCollision(void) {
  AlienGrid* ag = &gs.aliens;
  int hit = 0;
  for (int j = 0; j < ALIEN_COLS; j++) {
    Bullet* b = &ag->ab[j];
    if (b->state != BULLET_FIRE)
      continue;
    if (checkCollision(gs.ship.coords.x, gs.ship.coords.y, SHIP_W, SHIP_H,
                       b->coords.x, b->coords.y, BULLET_W, BULLET_H)) {
      resetAlienBullet(j);
      hit = 1;
    }
  }
  return hit;
}

static void updateMainAlienBulletCollision(void) {
  MainAlien* ma = &gs.mysteryAlien;
  Bullet* b = &gs.bullet;
  if (b->state != BULLET_FIRE)
    return;

  if (checkCollision(ma->coords.x, ma->coords.y, MAIN_ALIEN_W, MAIN_ALIEN_H,
                     b->coords.x, b->coords.y, BULLET_W, BULLET_H)) {
    gs.score += 50;
    fillRectangle(ma->coords.x, ma->coords.y, MAIN_ALIEN_W, MAIN_ALIEN_H, 0);
    putImage(ma->coords.x, ma->coords.y, ALIEN_W, ALIEN_H, explosion, 1, 0);
    start_sound_effect_ch1(explode_notes, explode_times, explode_note_count, 0);
    delay(100);
    fillRectangle(ma->coords.x, ma->coords.y, ALIEN_W, ALIEN_H, 0);
    start_sound_effect_ch1(explode_notes, explode_times, explode_note_count, 0);

    initMainAlien(&gs.mysteryAlien);
  }
}

